src/LeggettAndPlatt.Vertex/Service References/LookupTaxAreas70Service/LookupTaxAreas70.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:vev="urn:vertexinc:o-series:tps:7:0" xmlns:wsdlsoap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns1="http://www.vertexinc.com/oseries/services/LookupTaxAreas70" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://www.vertexinc.com/oseries/services/LookupTaxAreas70" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
  <wsdl:types>
    <xsd:schema>
      <xsd:import schemaLocation="../xsd/7.0/VertexInc_Envelope.xsd" namespace="urn:vertexinc:o-series:tps:7:0" />
    </xsd:schema>
  </wsdl:types>
  <wsdl:message name="lookupTaxAreasRequest">
    <wsdl:part name="inDoc" element="vev:VertexEnvelope" />
  </wsdl:message>
  <wsdl:message name="lookupTaxAreasResponse">
    <wsdl:part name="VertexEnvelope" element="vev:VertexEnvelope" />
  </wsdl:message>
  <wsdl:portType name="LookupTaxAreasWS70">
    <wsdl:operation name="LookupTaxAreas70">
      <wsdl:input name="lookupTaxAreasRequest" message="tns1:lookupTaxAreasRequest" />
      <wsdl:output name="lookupTaxAreasResponse" message="tns1:lookupTaxAreasResponse" />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="LookupTaxAreas70SoapBinding" type="tns1:LookupTaxAreasWS70">
    <wsdlsoap:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <wsdl:operation name="LookupTaxAreas70">
      <wsdlsoap:operation soapAction="" />
      <wsdl:input name="lookupTaxAreasRequest">
        <wsdlsoap:body use="literal" />
      </wsdl:input>
      <wsdl:output name="lookupTaxAreasResponse">
        <wsdlsoap:body use="literal" />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="LookupTaxAreasWSService70">
    <wsdl:port name="LookupTaxAreas70" binding="tns1:LookupTaxAreas70SoapBinding">
      <wsdlsoap:address location="https://10.21.9.59:8443/vertex-ws/services/LookupTaxAreas70" />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>