xsdparser/test1.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:VertexEnvelope xmlns:ns2="urn:vertexinc:o-series:tps:7:0"><ns2:Login><ns2:TrustedId>0504958370492816</ns2:TrustedId></ns2:Login><ns2:QuotationRequest transactionType="SALE"><ns2:Seller><ns2:PhysicalOrigin><ns2:StreetAddress1>302 Meadowlands dr</ns2:StreetAddress1><ns2:City>Hillsborough</ns2:City><ns2:MainDivision>NC</ns2:MainDivision><ns2:PostalCode>27278</ns2:PostalCode><ns2:Country>United States</ns2:Country></ns2:PhysicalOrigin></ns2:Seller><ns2:Customer><ns2:Destination><ns2:StreetAddress1>26 La Corso Pl</ns2:StreetAddress1><ns2:StreetAddress2>Apt B</ns2:StreetAddress2><ns2:City>Walnut Creek</ns2:City><ns2:MainDivision>CA</ns2:MainDivision><ns2:PostalCode>94598-2265</ns2:PostalCode><ns2:Country>United States</ns2:Country></ns2:Destination></ns2:Customer><ns2:LineItem lineItemNumber="246866431"><ns2:Product>M514</ns2:Product><ns2:Quantity>1.0</ns2:Quantity><ns2:UnitPrice>10.97</ns2:UnitPrice></ns2:LineItem><ns2:LineItem lineItemNumber="246866659"><ns2:Product>873U</ns2:Product><ns2:Quantity>1.0</ns2:Quantity><ns2:UnitPrice>14.95</ns2:UnitPrice></ns2:LineItem><ns2:LineItem lineItemNumber="246866986"><ns2:Product>332U</ns2:Product><ns2:Quantity>1.0</ns2:Quantity><ns2:UnitPrice>14.95</ns2:UnitPrice></ns2:LineItem><ns2:LineItem lineItemNumber="0"><ns2:Product>Shipping</ns2:Product><ns2:Quantity>1.0</ns2:Quantity><ns2:UnitPrice>7.99</ns2:UnitPrice></ns2:LineItem><ns2:LineItem lineItemNumber="0"><ns2:Product>Insurance</ns2:Product><ns2:Quantity>1.0</ns2:Quantity><ns2:UnitPrice>2.25</ns2:UnitPrice></ns2:LineItem></ns2:QuotationRequest></ns2:VertexEnvelope></SOAP-ENV:Body></SOAP-ENV:Envelope>